In [1]:
import pandas as pd
print (pd.__version__)

1.2.4

In [2]:
#2

import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [3]:
pd.Series(mylist)

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [4]:
pd.Series(myarr)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int32

In [5]:
pd.Series(mydict)

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int64

In [6]:
#3

mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [7]:
mydict

{'a': 0,
 'b': 1,
 'c': 2,
 'e': 3,
 'd': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}

In [8]:
ser

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int64

In [9]:
# .to_frame   make it into a DataFrame

# .reset_index() will make the index of the series into index

df= ser.to_frame().reset_index()
df

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

In [10]:
#4.

import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [11]:
pd.concat([ser1, ser2], axis=1)

    0   1
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

In [12]:
df = pd.DataFrame({'col1': ser1, 'col2': ser2})
print(df.head())

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

In [13]:
#5 

ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz')).rename('alphabets', inplace=True)

In [14]:
ser

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: alphabets, dtype: object

In [15]:
#6

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [16]:
list(ser1)

[1, 2, 3, 4, 5]

In [17]:
list(ser2)

[4, 5, 6, 7, 8]

In [18]:
ser3= list(ser1) + list(ser2)

In [19]:
ser3

[1, 2, 3, 4, 5, 4, 5, 6, 7, 8]

In [20]:
ser3= pd.Series(ser3)
ser3

0    1
1    2
2    3
3    4
4    5
5    4
6    5
7    6
8    7
9    8
dtype: int64

In [21]:
ser3.drop_duplicates()

0    1
1    2
2    3
3    4
4    5
7    6
8    7
9    8
dtype: int64

In [22]:
# beautiful code. Look at .isin()

ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

In [23]:
#7

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [24]:
ser123 = ser1[~ser1. isin(ser2)]
ser123

0    1
1    2
2    3
dtype: int64

In [25]:
ser456= ser2[~ser2. isin(ser1)]
ser456

2    6
3    7
4    8
dtype: int64

In [26]:
pd.concat([ser123, ser456])

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64

In [27]:
# alternate way..... np.union1d(ser1, ser2) to unite 2 series
#              ..... np.intersect1d(ser1, ser2) to find intersection of 2 series

In [28]:
serunion= pd.Series(np.union1d (ser123, ser456))

In [29]:
serintersect= pd.Series(np.intersect1d (ser123, ser456))

In [30]:
serunion[~serunion. isin(serintersect) ]

0    1
1    2
2    3
3    6
4    7
5    8
dtype: int64

In [31]:
#8

ser = pd.Series(np.random.normal(10, 5, 25))
ser.describe()

count    25.000000
mean      9.826545
std       3.970303
min       1.513468
25%       6.836008
50%      10.793736
75%      11.478468
max      15.988443
dtype: float64

In [32]:
# frequency counts of unique items 

ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

g    7
c    5
f    5
h    4
b    3
a    2
d    2
e    2
dtype: int64

In [33]:
#9. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
ser

0     4
1     2
2     2
3     2
4     4
5     2
6     1
7     4
8     2
9     1
10    2
11    1
dtype: int32

In [34]:
L=[n for n in ser if (n!=4 in ser)]

for n in L:
    print(n, end=' ')

2 2 2 2 1 2 1 2 1

In [35]:
ser.value_counts().sort_values(ascending=False)

2    6
1    3
4    3
dtype: int64

In [36]:
ser [~ser .isin (ser.value_counts().index[1:])] = 'other'
ser

0         4
1     other
2     other
3     other
4         4
5     other
6         1
7         4
8     other
9         1
10    other
11        1
dtype: object

In [37]:
#10

In [38]:
ser = pd.Series(np.random.random(20))
ser.head()

0    0.712160
1    0.185457
2    0.080951
3    0.869967
4    0.703130
dtype: float64

In [39]:
pd.qcut(ser, q=[0,0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,1],
       labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th'])

0      9th
1      2nd
2      1st
3     10th
4      8th
5      5th
6     10th
7      7th
8      5th
9      3rd
10     7th
11     6th
12     3rd
13     2nd
14     4th
15     4th
16     9th
17     1st
18     6th
19     8th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

In [40]:
#11

In [41]:
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     8
1     8
2     7
3     9
4     6
5     6
6     4
7     7
8     7
9     6
10    3
11    4
12    2
13    6
14    6
15    1
16    5
17    6
18    1
19    3
20    2
21    3
22    3
23    1
24    7
25    3
26    1
27    1
28    3
29    3
30    9
31    8
32    5
33    9
34    9
dtype: int32

In [42]:
# .values.reshape(7,5)

pd.DataFrame(ser.values.reshape(7,5))

   0  1  2  3  4
0  8  8  7  9  6
1  6  4  7  7  6
2  3  4  2  6  6
3  1  5  6  1  3
4  2  3  3  1  7
5  3  1  1  3  3
6  9  8  5  9  9

In [43]:
#12

In [44]:
ser = pd.Series(np.random.randint(1, 10, 7))
ser

0    8
1    5
2    9
3    1
4    7
5    2
6    4
dtype: int32

In [45]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [46]:
# .take() function

ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

In [47]:
#13

ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [48]:
pd.DataFrame([ser1, ser2])

   0  1  2  3  4
0  0  1  2  3  4
1  a  b  c  d  e

In [49]:
pd.concat([ser1, ser2], axis=1)

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [50]:
pd.concat([ser1, ser2], axis=0)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [51]:
#14

In [52]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [53]:
[pd.Index(ser1).get_loc(i) for i in ser2]

[5, 4, 0, 8]

In [54]:
#15

In [55]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [56]:
np.mean((truth-pred)**2)

0.1853518763326801

In [57]:
#16  How to convert the first character of each element in a series to uppercase?

In [58]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [59]:
ser[0].capitalize()+' '+ ser[1].capitalize()+' '+ ser[2].capitalize()+ ' '+ ser[3].capitalize()

'How To Kick Ass?'

In [60]:
pd.Series(i.capitalize() for i in ser)

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [61]:
pd.Series(i.title() for i in ser)

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [62]:
#17

In [63]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [64]:
len(ser[2])

4

In [65]:
ser.map(lambda x: len(x))

0    3
1    2
2    4
3    4
dtype: int64

In [66]:
#18  How to compute difference of differences between consequtive numbers of a series?

In [67]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [68]:
(ser[2]-ser[1]) - (ser[1]-ser[0])

1

In [69]:
# use .diff() and .to_list()

ser.diff().to_list()

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

In [70]:
ser.diff().diff().to_list()

[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [71]:
#19 How to convert a series of date-strings to a timeseries?

In [72]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [73]:
ser= pd.to_datetime(ser)
ser

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [74]:
#20 How to get the day of month, week number, day of year and day of week from a series of date strings?

In [75]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

from dateutil.parser import parse
ser_ts = ser.map(lambda x: parse(x))

In [76]:
print("Date: ", ser_ts.dt.day.tolist())

Date:  [1, 2, 3, 4, 5, 6]

In [77]:
print("Week number: ", ser_ts.dt.weekofyear.tolist())

Week number:  [53, 5, 9, 14, 19, 23]

<ipython-input-77-b5927a9b48a1>:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  print("Week number: ", ser_ts.dt.weekofyear.tolist())

In [78]:
print("Day number from year: ", ser_ts.dt.dayofyear.tolist())

Day number from year:  [1, 33, 63, 94, 125, 157]

In [79]:
print("Day of week: ", ser_ts.dt.weekday.tolist())

Day of week:  [4, 2, 5, 3, 0, 5]

In [80]:
#21 How to filter words that contain atleast 2 vowels from a series?

In [81]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [82]:
from collections import Counter

In [83]:
mask= ser.map(lambda x: sum([Counter (x.lower()).get(i,0) for i in list ('aeiou')]) >=2)

ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

In [ ]:
#22 How to filter valid emails from a series?

In [85]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'